Merge pull request #3 from pdf-tools/feature/hitl-web
Add HITL Web UI
